class StockChart:
    header_dic = {
        "0": "종목코드", 
        "1": "필드 개수",
        "2": "필드명의 배열",
        "3": "수신 개수",
        "4": "시간(hhmm)", 
        "5": "최근거래일",
        "6": "전일종가",
        "7": "현재가",
        "8": "대비부호",
        "9": "대비",
        "10": "거래량",
        "11": "매도호가",
        "12": "매수호가",
        "13": "시가",
        "14": "고가",
        "15": "저가",
        "16": "거래대금",
        "17": "종목상태",
        "18": "상장주식 수",
        "19": "자본금(백만)",
        "20": "전일거래량",
        "21": "최근갱신시간(long)",
        "22": "상한가",
        "23": "하한가"
    }

    # 대비부호 
    compare_mark_dic = {
        "1": "상한",
        "2": "상승",
        "3": "보합",
        "4": "하한",
        "5": "하락",
        "6": "기세상한",
        "7": "기세상승",
        "8": "기세하한",
        "9": "기세하락"
    }

    


